# AreaTagType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaTagType Class
Members See Also
---
An object that represents an Area Tag style.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class AreaTagType : FamilySymbol
```

Visual Basic
---
```text
Public Class AreaTagType _
	Inherits FamilySymbol
```

Visual C++
---
```text
public ref class AreaTagType : public FamilySymbol
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..InsertableObject Autodesk.Revit.DB..::..FamilySymbol Autodesk.Revit.DB..::..AreaTagType
# See Also
AreaTagType Members
Autodesk.Revit.DB Namespace